// TODO 添加一个定时器 定时执行 

#include <ntifs.h>
#include <ntimage.h>
#include <windef.h>


#pragma warning(disable: 4054 4055) 

extern ULONG * InitSafeBootMode;

#ifdef DBG
#define dbg_msg(Format, ...) DbgPrint("[hidedir]%d-%s:" Format "\n",__LINE__,__FUNCTION__, __VA_ARGS__)
#define dbg_brk() {__asm int 3}
#else
#define dbg_msg
#define dbg_brk
#endif

#define AV_MEM_TAG 'AvTg'
#define ObjectNameInformation 1
#pragma pack(push,1)

typedef struct _GLOBAL
{
    ULONG* pSSDTBase;
    ULONG ulSSDTNum;
    PVOID hNtoskrnl;
    ULONG uNtoskrnlSize;
}GLOBAL;

typedef struct _NATIVE_ENTRY
{
    UCHAR mov;	//0x8B
    ULONG NativeIndex;
}NATIVE_ENTRY;

#pragma pack(pop)

typedef struct _KSERVICE_TABLE_DESCRIPTOR
{
    PULONG_PTR	ServiceTableBase;
    PULONG		ServiceCounterTableBase;
    ULONG		NumberOfServices;
    PUCHAR		ParamTableBase;
} KSERVICE_TABLE_DESCRIPTOR, *PKSERVICE_TABLE_DESCRIPTOR;

typedef struct _MODULE_NODE
{
    /* 0x00 */   ULONG Section;
    /* 0x04 */   PVOID MappedBase;
    /* 0x08 */   PVOID ImageBase;
    /* 0x0C */   ULONG ImageSize;
    /* 0x10 */   ULONG Flags;
    /* 0x14 */   USHORT LoadOrderIndex;
    /* 0x18 */   USHORT InitOrderIndex;
    /* 0x1C */   USHORT LoadCount;
    /* 0x00 */   USHORT OffsetToFileName;
    CHAR FullPathName[256];
}SYSTEM_MODULE_NODE;

typedef struct _SYSTEM_MODULES_INFO
{
    ULONG NumberOfModules;
    SYSTEM_MODULE_NODE Modules[1];
}SYSTEM_MODULES_INFO;


typedef enum _SYSTEM_INFORMATION_CLASS
{
    SystemBasicInformation,
    SystemProcessorInformation,
    SystemPerformanceInformation,
    SystemTimeOfDayInformation,
    SystemPathInformation, /// Obsolete: Use KUSER_SHARED_DATA
    SystemProcessInformation,
    SystemCallCountInformation,
    SystemDeviceInformation,
    SystemProcessorPerformanceInformation,
    SystemFlagsInformation,
    SystemCallTimeInformation,
    SystemModuleInformation,
    SystemLocksInformation,
    SystemStackTraceInformation,
    SystemPagedPoolInformation,
    SystemNonPagedPoolInformation,
    SystemHandleInformation,
    SystemObjectInformation,
    SystemPageFileInformation,
    SystemVdmInstemulInformation,
    SystemVdmBopInformation,
    SystemFileCacheInformation,
